Public Attributes | List of all members
API_ModulID Struct Reference
Add-On - Add-On Communication
Unique identifier of an add-on. More...
#include <APIdefs_Registration.h>
 Public Attributes
GSType  | developerID
The unique ID of the add-on developer. Generated by Graphisoft upon registration.
GSType  | localID
The add-on's specific identifier. The developer is responsible to select different local IDs.
Detailed Description
Unique identifier of an add-on.
Remarks
This structure refers to the 'MDID' resource. The data structure is used directly by the Communication Manager, to identify the target add-on. The add-on's modul ID is also used by the ModulData Manager to identify the owners of the custom data sections saved into the project files.
Member Data Documentation
◆ developerID
 API_ModulID::developerID
The unique ID of the add-on developer. Generated by Graphisoft upon registration.
◆ localID
 API_ModulID::localID
The add-on's specific identifier. The developer is responsible to select different local IDs.